In [1]:
#pd.concat([df1,df2]) -> To stack dataframes horizontally or vertically
#pd.merge([df1,df2]) -> Join based on columns
#join and merge has similar functionalities. But merge is simpler, so we'll use merge

In [2]:
import pandas as pd

In [17]:
movie_cols = ['movie_id', 'title']
movies = pd.read_csv('movies.csv', names=movie_cols, usecols=[0, 1])
movies.drop(movies.index[0],inplace=True)
movies.head()

  movie_id                               title
1        1                    Toy Story (1995)
2        2                      Jumanji (1995)
3        3             Grumpier Old Men (1995)
4        4            Waiting to Exhale (1995)
5        5  Father of the Bride Part II (1995)

In [7]:
movies.shape

(9743, 2)

In [33]:
movies.movie_id.nunique()

9742

In [35]:
movies['movie_id'] = movies['movie_id'].astype(int)

In [19]:
rating_cols = ['user_id', 'movie_id', 'rating', 'timestamp']
ratings = pd.read_table('ratings.csv', sep=',', names=rating_cols )
ratings.drop(ratings.index[0],inplace=True)
ratings.head()

  user_id movie_id rating  timestamp
1       1        1    4.0  964982703
2       1        3    4.0  964981247
3       1        6    4.0  964982224
4       1       47    5.0  964983815
5       1       50    5.0  964982931

In [27]:
ratings.columns

Index(['user_id', 'movie_id', 'rating', 'timestamp'], dtype='object')

In [28]:
ratings.movie_id.nunique()

9724

In [31]:
ratings['movie_id'] = ratings['movie_id'].astype(int)

In [32]:
ratings.loc[ratings.movie_id == 1, :].head()

     user_id  movie_id rating   timestamp
1          1         1    4.0   964982703
517        5         1    4.0   847434962
875        7         1    4.5  1106635946
1435      15         1    2.5  1510577970
1668      17         1    4.5  1305696483

In [36]:
movie_ratings = pd.merge(movies,ratings,on='movie_id')

In [37]:
movie_ratings.head()

   movie_id             title user_id rating   timestamp
0         1  Toy Story (1995)       1    4.0   964982703
1         1  Toy Story (1995)       5    4.0   847434962
2         1  Toy Story (1995)       7    4.5  1106635946
3         1  Toy Story (1995)      15    2.5  1510577970
4         1  Toy Story (1995)      17    4.5  1305696483

### What if the columns you want to join on don't have the same name?

In [38]:
movies.columns = ['m_id', 'title']
movies.columns

Index(['m_id', 'title'], dtype='object')

In [41]:
ratings.columns

Index(['user_id', 'movie_id', 'rating', 'timestamp'], dtype='object')

In [42]:
pd.merge(movies, ratings, left_on='m_id', right_on='movie_id').head()

   m_id             title user_id  movie_id rating   timestamp
0     1  Toy Story (1995)       1         1    4.0   964982703
1     1  Toy Story (1995)       5         1    4.0   847434962
2     1  Toy Story (1995)       7         1    4.5  1106635946
3     1  Toy Story (1995)      15         1    2.5  1510577970
4     1  Toy Story (1995)      17         1    4.5  1305696483

### What if you want to join on one index?¶

In [43]:
movies = movies.set_index('m_id')
movies.head()

                                   title
m_id
1                       Toy Story (1995)
2                         Jumanji (1995)
3                Grumpier Old Men (1995)
4               Waiting to Exhale (1995)
5     Father of the Bride Part II (1995)

In [44]:
pd.merge(movies, ratings, left_index=True, right_on='movie_id').head()

                 title user_id  movie_id rating   timestamp
1     Toy Story (1995)       1         1    4.0   964982703
517   Toy Story (1995)       5         1    4.0   847434962
875   Toy Story (1995)       7         1    4.5  1106635946
1435  Toy Story (1995)      15         1    2.5  1510577970
1668  Toy Story (1995)      17         1    4.5  1305696483

### What if you want to join on two indexes?

In [45]:
ratings = ratings.set_index('movie_id')
ratings.head()

         user_id rating  timestamp
movie_id
1              1    4.0  964982703
3              1    4.0  964981247
6              1    4.0  964982224
47             1    5.0  964983815
50             1    5.0  964982931

In [46]:
pd.merge(movies, ratings, left_index=True, right_index=True).head()

              title user_id rating   timestamp
1  Toy Story (1995)       1    4.0   964982703
1  Toy Story (1995)       5    4.0   847434962
1  Toy Story (1995)       7    4.5  1106635946
1  Toy Story (1995)      15    2.5  1510577970
1  Toy Story (1995)      17    4.5  1305696483

### Example DataFrames A and B¶

In [47]:
A = pd.DataFrame({'color': ['green', 'yellow', 'red'], 'num':[1, 2, 3]})
A

    color  num
0   green    1
1  yellow    2
2     red    3

In [48]:
B = pd.DataFrame({'color': ['green', 'yellow', 'pink'], 'size':['S', 'M', 'L']})
B

    color size
0   green    S
1  yellow    M
2    pink    L

### Inner join¶
Only include observations found in both A and B:

In [49]:
pd.merge(A, B, how='inner')

    color  num size
0   green    1    S
1  yellow    2    M

### Outer join¶
Include observations found in either A or B:

In [50]:
pd.merge(A, B, how='outer')

    color  num size
0   green  1.0    S
1  yellow  2.0    M
2     red  3.0  NaN
3    pink  NaN    L

### Left join¶
Include all observations found in A:

In [52]:
pd.merge(A, B, how='left')

    color  num size
0   green    1    S
1  yellow    2    M
2     red    3  NaN

###  Right join¶
Include all observations found in B:

In [53]:
pd.merge(A, B, how='right')

    color  num size
0   green  1.0    S
1  yellow  2.0    M
2    pink  NaN    L